vegeta-cli/src/vegeta/aeromant/templates/hull_rotor_disk/org/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    body
    {
        type triSurface;
        file "body.stl";
    }
    diskLeft
    {
        type cylinder;
        point1 ({{DISK1_P1}});
        point2 ({{DISK1_P2}});
        radius {{DISK_ZONE_RADIUS}};
    }
    nearBox
    {
        type box;
        min ({{NEAR_MIN}});
        max ({{NEAR_MAX}});
    }
    wakeBox
    {
        type box;
        min ({{WAKE_MIN}});
        max ({{WAKE_MAX}});
    }
};

castellatedMeshControls
{
    maxLocalCells           2000000;
    maxGlobalCells          8000000;
    minRefinementCells      0;
    maxLoadUnbalance        0.10;
    nCellsBetweenLevels     3;

    features
    (
        {
            file "body.eMesh";
            level {{FEATURE_LEVEL}};
        }
    );

    refinementSurfaces
    {
        body
        {
            level ({{SURFACE_LEVEL_MIN}} {{SURFACE_LEVEL_MAX}});
            patchInfo
            {
                type wall;
            }
        }
        diskLeft
        {
            level (0 0);
            faceZone diskLeft;
            cellZone diskLeft;
            cellZoneInside inside;
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        diskLeft
        {
            mode inside;
            level {{DISK_LEVEL}};
        }
        wakeBox
        {
            mode inside;
            level {{WAKE_LEVEL}};
        }
        nearBox
        {
            mode inside;
            level {{NEAR_LEVEL}};
        }
    }

    insidePoint ({{LOCATION_IN_MESH}});
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              50;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes           true;
    layers
    {
    }
    expansionRatio          1.2;
    finalLayerThickness     0.5;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minFlatness             0.5;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.05;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
